alice_in_wonderland = f'"Would you tell me, please, which way I ought to go from here?"'\
                      '\n"That depends a good deal on where you want to get to," said the Cat.'\
                      '\n"I don\'t much care where ——" said Alice.'\
                      '\n"Then it doesn\'t matter which way you go," said the Cat.'\
                      '\n"—— so long as I get somewhere," Alice added as an explanation.'\
                      '\n"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'

print(alice_in_wonderland)
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""

black_sea_sq = 436402
azov_sea_sq = 37800
print(f'Сумарна площа Чорного та Азовського морів дорівнює: {black_sea_sq + azov_sea_sq} км2')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

prod_quantity = 375291
warehouse_1_2 = 250449
warehouse_2_3 = 222950
warehouse_1 = prod_quantity - warehouse_2_3
warehouse_3 = prod_quantity - warehouse_1_2
warehouse_2 = prod_quantity - (warehouse_1 + warehouse_3)
print(f'Кількість товарів на першому складі: {warehouse_1}, \n'
      f'Кількість товарів на другому складі: {warehouse_2}, \n'
      f'Кількість товарів на третьому складі: {warehouse_3}.')


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""

loan_duration = 12 * 1.5
monthly_payment = 1179
print(f"Вартість комп'ютера становить: {monthly_payment * loan_duration}.")


# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""

print(f'Остаток від ділення чисел:\n'
      f'a) 8019 : 8 = {8019 % 8}     d) 7248 : 6 = {7248 % 6} \n'
      f'b) 9907 : 9 = {9907 % 9}     e) 7128 : 5 = {7128 % 5} \n'
      f'c) 2789 : 5 = {2789 % 5}     f) 19224 : 9 = {19224 % 9}')

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""

big_pizza = 274 * 4
mid_pizza = 218 * 2
juice = 35 * 4
cake = 350 * 1
water = 21 * 3
print(f'Для дня народження Іринці знадобиться:\n'
      f'На 4 великих піци вартістю 274 грн за одиницю: {big_pizza}грн\n'
      f'На 2 середніх піци вартістю 218 грн за одиницю: {mid_pizza}грн\n'
      f'На 4 пачки соку вартістю 35 грн за одиницю: {juice}грн\n'
      f'На 1 торт вартістю 350 грн за одиницю: {cake}грн\n'
      f'На 3 пляшки води вартістю 21 грн за одиницю: {water}грн\n'
      f'Всього грошей знадобиться: {big_pizza + mid_pizza + juice + cake + water}грн')

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""

photos = 232
photos_per_page = 8
album_pages = photos // photos_per_page
print(f'Для розміщення {photos} фотографій по {photos_per_page} на одну сторінку альбому, Ігорю знадобиться {album_pages} сторінок')


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

distance = 1600
fuel_tank = 48
fuel_spent_per_100km = 9
fuel_spent = distance / 100 * 9
distance_per_tank = fuel_tank / fuel_spent_per_100km * 100
gas_station_stops = distance // distance_per_tank
print(f'Для подпорожі з Харкова у Будапешт Родині знадобиться {fuel_spent} літрів бензину\n'
      f'Кількість заправок становить {gas_station_stops},\n'
      f'Або якщо припустити що на момент початку подорожі паливний бак вже заправленний то {gas_station_stops - 1} заправки')
